---
title: DisplacementElementFailures
classe: Autodesk.Revit.DB.BuiltInFailures+DisplacementElementFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# DisplacementElementFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotCopyDisplacementSetIntoOtherDocument { get; }` | `DisplacementElementFailures.CannotCopyDisplacementSetIntoOtherDocument` | FailureDefinitionId |
| `FailureDefinitionId CannotRemoveLastDisplacedElement { get; }` | `DisplacementElementFailures.CannotRemoveLastDisplacedElement` | FailureDefinitionId |
| `FailureDefinitionId DetectedCycleInDisplacedElementParents { get; }` | `DisplacementElementFailures.DetectedCycleInDisplacedElementParents` | FailureDefinitionId |
| `FailureDefinitionId ElementsAlreadyDisplacedInView { get; }` | `DisplacementElementFailures.ElementsAlreadyDisplacedInView` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```